direct/test/resources/soap/update_data2_smoke.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:namesp2="http://xml.apache.org/xml-soap" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
    <SOAP-ENV:Body>
        <namesp1:UpdateData2 xmlns:namesp1="YaBSSOAPExport">
            <request xsi:type="namesp2:SOAPStruct">
                <EngineID xsi:type="xsd:int">7</EngineID>
                <RequestUUID xsi:type="xsd:string">0076319C-0F98-11EA-A61D-62C3229A9442</RequestUUID>
                <ORDER xsi:type="namesp2:SOAPStruct">
                    <O_23233775_38965517 xsi:type="namesp2:SOAPStruct">
                        <EID xsi:type="xsd:int">38965517</EID>
                        <ID xsi:type="xsd:int">23233775</ID>
                        <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                        <Stop xsi:type="xsd:int">1</Stop>
                        <OrderType xsi:type="xsd:int">1</OrderType>
                        <GroupOrder xsi:type="xsd:int">0</GroupOrder>
                        <GroupOrderID xsi:type="xsd:int">11903457</GroupOrderID>
                        <ClientID xsi:type="xsd:int">22069311</ClientID>
                        <AgencyID xsi:type="xsd:int">50537</AgencyID>
                        <ManagerUID xsi:type="xsd:int">0</ManagerUID>
                        <ContentType xsi:type="xsd:string">text</ContentType>
                        <IndependentBids xsi:type="xsd:int">0</IndependentBids>
                        <QueueSetTime xsi:type="xsd:string">20190516055554</QueueSetTime>
                        <Description xsi:type="xsd:string">38965517: nsh-srch-cat-nz-computers</Description>
                        <AttributionType xsi:type="xsd:int">4</AttributionType>
                        <AutoOptimization xsi:type="xsd:int">0</AutoOptimization>
                        <MaxCPC xsi:type="xsd:int">0</MaxCPC>
                        <CONTEXT xsi:type="namesp2:SOAPStruct">
                            <C_218699565_3580015259 xsi:type="namesp2:SOAPStruct">
                                <EID xsi:type="xsd:int">3580015259</EID>
                                <ID xsi:type="xsd:int">218699565</ID>
                                <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                            </C_218699565_3580015259>
                            <C_218699565_3580015260 xsi:type="namesp2:SOAPStruct">
                                <EID xsi:type="xsd:int">3580015260</EID>
                                <ID xsi:type="xsd:int">218699565</ID>
                                <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                            </C_218699565_3580015260>
                        </CONTEXT>
                    </O_23233775_38965517>
                    <O_23366890_39192675 xsi:type="namesp2:SOAPStruct">
                        <EID xsi:type="xsd:int">39192675</EID>
                        <ID xsi:type="xsd:int">23366890</ID>
                        <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                        <Stop xsi:type="xsd:int">0</Stop>
                        <OrderType xsi:type="xsd:int">1</OrderType>
                        <GroupOrder xsi:type="xsd:int">0</GroupOrder>
                        <GroupOrderID xsi:type="xsd:int">15580972</GroupOrderID>
                        <ClientID xsi:type="xsd:int">33265089</ClientID>
                        <AgencyID xsi:type="xsd:int">0</AgencyID>
                        <ManagerUID xsi:type="xsd:int">0</ManagerUID>
                        <ContentType xsi:type="xsd:string">reach</ContentType>
                        <IndependentBids xsi:type="xsd:int">1</IndependentBids>
                        <QueueSetTime xsi:type="xsd:string">20190814204520</QueueSetTime>
                        <Description xsi:type="SOAP-ENC:base64">MzkxOTI2NzU6ICDQk9Cw0LfQv9GA0L7QvCDQmtC+0YHQvNC40YfQtdGB0LrQuNC1INCh0LjRgdGC0LXQvNGLIFtSVEJdIFs0NS01NF0=</Description>
                        <AttributionType xsi:type="xsd:int">4</AttributionType>
                        <BillingOrders xsi:type="xsd:string">skipped in SOAP</BillingOrders>
                        <AutoOptimization xsi:type="xsd:int">0</AutoOptimization>
                        <MaxCPC xsi:type="xsd:int">0</MaxCPC>
                        <CONTEXT xsi:type="namesp2:SOAPStruct">
                            <C_1808523229_3590529107 xsi:type="namesp2:SOAPStruct">
                                <EID xsi:type="xsd:int">3590529107</EID>
                                <ID xsi:type="xsd:int">1808523229</ID>
                                <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                            </C_1808523229_3590529107>
                            <C_1808523229_3590529108 xsi:type="namesp2:SOAPStruct">
                                <EID xsi:type="xsd:int">3590529108</EID>
                                <ID xsi:type="xsd:int">1808523229</ID>
                                <UpdateInfo xsi:type="xsd:int">1</UpdateInfo>
                            </C_1808523229_3590529108>
                        </CONTEXT>
                    </O_23366890_39192675>
                </ORDER>
            </request>
            <workerID xsi:type="xsd:int">1001</workerID>
        </namesp1:UpdateData2>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
